{
  "id": 24428,
  "page": 1,
  "results": [
    {
      "author": "xenocast",
      "content":
        "With a movie like this you wonder how all of the otherwise, main characters will work together and support the story.\r\n\r\nNo problems here.  While as might be expected, R. Downey Jr. comes across largely central, it is still a good mix and IMHO the best scenes in the movie involve the generated Hulk character.\r\n\r\nWith that kind of successful melding of characters, Hollywood-scale egos and even computer generated characters; you have to give it up to the writers and director to make this the successful film that it is.",
      "id": "4fce8f8819c29523880000de",
      "url": "https://www.themoviedb.org/review/4fce8f8819c29523880000de"
    },
    {
      "author": "Gimly",
      "content":
        "**A long format review from 2012**\r\n\r\nMy new favourite Marvel Cinematic Universe film, undoubtedly! Order goes thusly;\r\n\r\n1. The Avengers\r\n2. Iron Man\r\n3. Thor\r\n4. Captain America\r\n5. Iron Man 2\r\n6. The Incredible Hulk\r\n\r\nI had the privilege of going to Sydney and watching this almost a full three weeks before it’s American release, in a special advance screening for fans and a handful of critics. I drove up and back on a day trip with my mate HRV, spent over $400 between us… So worth it.\r\n\r\nI think perhaps my expectations of The Avengers were too high. In fact I know they were, even so, I feel that it almost managed to meet them. All but two of the fears I had about this epic were quashed without a doubt. I initially was worried about Mark Ruffalo helming the role of The Hulk/Bruce Banner after taking over from Edward Norton who was ousted after his first appearance. My complaints were completely unfounded however, as Mark Ruffalo presents us with an at least as good Marvel Hero. \r\n\r\nIn terms of entertainment, The Avengers is one of the greatest feats ever produced. At the screening I went to, I actually missed more than a couple of lines due to the fact that the entire bloody cinema was in hysterics from some classic Joss Whedon (Director - Buffy, Angel, Firefly, Dollhouse) humour. The squabbles between these larger than life characters are not quite up to the peak that Jon Favreau’s Iron Man & Iron Man 2 sit on, but in terms of film in general, they are some of the better interactions I’ve ever seen.\r\n\r\nThe only weak points I really have to whinge about are both quite minor, and perhaps can be rectified in the MCU future. Firstly, Thor’s return to Earth (whilst brilliantly dramatic and pretty) was quite weak in terms of exposition. That said, this isn’t a Thor movie, so we don’t need to know everything that happens to him. Also, in next year’s Thor 2, it is very possible we’ll discover more specific details about the first few scenes of his return. Secondly, Loki’s army also came across to me quite weakly. In case we have any Marvel aficionados in the crowd, I won’t spoil it by telling you who they’re supposed to be, but in general the whole army was essentially a meat shield used to bump out scenes in which The Avengers get to kick ass. A very enjoyable part of the film, but one that doesn’t really drive the story at all.\r\n\r\nI feel the only way I can adequately describe just how much you need to see this movie (in cinemas) is this: For those of you who understand me, you will be know and be aware of just how much I fucking hate the concept of Blu-Ray. I am going to buy a Blu-Ray player, a HD television, and Blu-Ray discs, just so that I will get more special features when The Avengers is released. Never have I even considered doing such a thing before.\r\n\r\nThe Avengers doesn’t get into your mind and rape it in the best way possible like Revolver or Donnie Darko. It doesn’t get into your guts and turn them with nostalgic violence like the brilliance in Doomsday or Outpost. It gets into your heart, and leaves you not just wanting, but needing more. Long live the MCU!\r\n\r\n90%\r\n\r\n-Gimly",
      "id": "59f29e47c3a3687126003ccd",
      "url": "https://www.themoviedb.org/review/59f29e47c3a3687126003ccd"
    },
    {
      "author": "Per Gunnar Jonsson",
      "content":
        "After the recent disappointments from Marvel, notably Thor and the abysmal second instalment of Ghost Rider, this was a pleasant experience.\r\n\r\nThe special effects are dazzling, the plot is acceptable and the heroes are not making total idiots out of themselves just because the director wanted some “depth” to their characters. Sure there is a little bickering in between them but not too much to distract from the fun.\r\n\r\nI’ve always liked Robert Downey Jr’s portrayal of Tony Stark and his sharp tongue. I did wonder how they where going to get the Hulk in there since he’s supposed to be uncontrollable but they did it. Okay they downplayed his uncontrollability a bit but I can live with that. I absolutely loved the “puny god” scene (if you haven’t seen the film yet you’ll have to see it to know what I mean, I wont spoil it in advance).\r\n\r\nI have to say that I found Thor himself a bit underwhelming again though. I just expect something more imposing as the good of thunder. But then I’m Scandinavian so…\r\n\r\nAnyway, this was a great film. I enjoyed it very much.",
      "id": "5a657f809251410b2d030491",
      "url": "https://www.themoviedb.org/review/5a657f809251410b2d030491"
    }
  ],
  "total_pages": 1,
  "total_results": 3
}
